### Loading data into DataFrames ###

In [21]:
import pandas as pd

def pp(data):
    print('\n', data)

In [22]:
google_stock = pd.read_csv('./goog.csv')

pp(type(google_stock))

pp(google_stock.shape)

 <class 'pandas.core.frame.DataFrame'>

 (3313, 7)

In [23]:
google_stock.head(2)

         Date       Open       High        Low      Close  Adj Close    Volume
0  2004-08-19  49.676899  51.693783  47.669952  49.845802  49.845802  44994500
1  2004-08-20  50.178635  54.187561  49.925285  53.805050  53.805050  23005800

In [24]:
google_stock.tail(1)

            Date   Open        High    Low       Close   Adj Close   Volume
3312  2017-10-13  992.0  997.210022  989.0  989.679993  989.679993  1157700

In [27]:
google_stock.isnull().any()

Date         False
Open         False
High         False
Low          False
Close        False
Adj Close    False
Volume       False
dtype: bool

In [28]:
google_stock.describe()

,Open,High,Low,Close,Adj Close,Volume
count,3313.000000,3313.000000,3313.000000,3313.000000,3313.000000,3.313000e+03
mean,380.186092,383.493740,376.519309,380.072458,380.072458,8.038476e+06
std,223.818650,224.974534,222.473232,223.853780,223.853780,8.399521e+06
min,49.274517,50.541279,47.669952,49.681866,49.681866,7.900000e+03
25%,226.556473,228.394516,224.003082,226.407440,226.407440,2.584900e+06
50%,293.312286,295.433502,289.929291,293.029114,293.029114,5.281300e+06
75%,536.650024,540.000000,532.409973,536.690002,536.690002,1.065370e+07
max,992.000000,997.210022,989.000000,989.679993,989.679993,8.276810e+07

In [29]:
google_stock['Open'].describe()

count    3313.000000
mean      380.186092
std       223.818650
min        49.274517
25%       226.556473
50%       293.312286
75%       536.650024
max       992.000000
Name: Open, dtype: float64

In [30]:
google_stock['Open'].max()

992.0

In [33]:
data = pd.read_csv('./fake_company.csv')
data

   Year     Name Department  Age  Salary
0  1990    Alice         HR   25   50000
1  1990      Bob         RD   30   48000
2  1990  Charlie      Admin   45   55000
3  1991   Dakota         HR   26   52000
4  1991     Elsa         RD   31   50000
5  1991    Frank      Admin   46   60000
6  1992    Grace      Admin   27   60000
7  1992  Hoffman         RD   32   52000
8  1992    Inaar      Admin   28   62000

In [36]:
data.describe()

              Year        Age        Salary
count     9.000000   9.000000      9.000000
mean   1991.000000  32.222222  54333.333333
std       0.866025   7.870479   5147.815070
min    1990.000000  25.000000  48000.000000
25%    1990.000000  27.000000  50000.000000
50%    1991.000000  30.000000  52000.000000
75%    1992.000000  32.000000  60000.000000
max    1992.000000  46.000000  62000.000000

### Use the group by to sum up the salaries ###

In [37]:
data.groupby(['Year'])['Salary'].sum()

Year
1990    153000
1991    162000
1992    174000
Name: Salary, dtype: int64

In [38]:
data.groupby(['Name'])['Salary'].sum()

Name
Alice      50000
Bob        48000
Charlie    55000
Dakota     52000
Elsa       50000
Frank      60000
Grace      60000
Hoffman    52000
Inaar      62000
Name: Salary, dtype: int64

In [40]:
data.groupby(['Year', 'Department'])['Salary'].sum()

Year  Department
1990  Admin          55000
      HR             50000
      RD             48000
1991  Admin          60000
      HR             52000
      RD             50000
1992  Admin         122000
      RD             52000
Name: Salary, dtype: int64